ERP DEV.WMS/src/InformationRegisters/вмс_ЯчейкиПоЗонамБыстрогоДоступа/вмс_ЯчейкиПоЗонамБыстрогоДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_ЯчейкиПоЗонамБыстрогоДоступа</name>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗонаДоступа</name>
    <type>
      <types>CatalogRef.вмс_ГруппыЯчеек</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/AccumulationRegisters/вмс_ОперацияПоЯчейкам/вмс_ОперацияПоЯчейкам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вмс_ОперацияПоЯчейкам</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланируемыйРасход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПланируемыйПриход</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Ячейка</name>
    <type>
      <types>CatalogRef.вмс_МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контейнер</name>
    <type>
      <types>CatalogRef.вмс_Контейнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.вмс_СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.вмс_ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Упаковка</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Качество</name>
    <type>
      <types>EnumRef.вмс_КачествоТовара</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьАналитика</name>
    <type>
      <types>CatalogRef.вмс_АналитикаУчетаНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьУчетныйПараметр1</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
  <dimensions>
    <name>удалитьУчетныйПараметр2</name>
    <type>
      <types>Characteristic.вмс_СоответствиеМетаданных</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP DEV.WMS/src/InformationRegisters/вмс_МинОстаткиПоЗонамБыстрогоДоступа/вмс_МинОстаткиПоЗонамБыстрогоДоступа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_МинОстаткиПоЗонамБыстрогоДоступа</name>
  <resources>
    <name>МинимальныйОстаток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗонаДоступа</name>
    <type>
      <types>CatalogRef.вмс_ГруппыЯчеек</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Товар</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>DefinedType.вмс_ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/InformationRegisters/вмс_СтатусыДокументов/вмс_СтатусыДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>вмс_СтатусыДокументов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>CatalogRef.вмс_СтатусыДокументов</types>
    </type>
  </resources>
  <resources>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Помещение</name>
    <type>
      <types>CatalogRef.вмс_Помещения</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Распоряжение</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ERP DEV.WMS/src/Enums/вмс_ТипыЯчеек/вмс_ТипыЯчеек.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>вмс_ТипыЯчеек</name>
  <enumValues>
    <name>ЗонаПриемки</name>
  </enumValues>
  <enumValues>
    <name>ЗонаОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>Хранение</name>
  </enumValues>
  <enumValues>
    <name>ЗонаОтбора</name>
  </enumValues>
  <enumValues>
    <name>Карантин</name>
  </enumValues>
  <enumValues>
    <name>ЗонаКонтроля</name>
  </enumValues>
  <enumValues>
    <name>Подпитка</name>
  </enumValues>
  <enumValues>
    <name>Оператор</name>
  </enumValues>
  <enumValues>
    <name>Транзит</name>
  </enumValues>
</mdclass:Enum>

ERP DEV.WMS/src/Catalogs/вмс_Операции/вмс_Операции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>вмс_Операции</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ДанныеСКД</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаданиеКладовщикуРаспоряжение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗапрашиватьУслугиХранения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлассОперацииХранилище</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяФорма</name>
    <type>
      <types>CatalogRef.вмс_ИнтерфейсыТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработкаВФормеСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоРаспоряжению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Поток</name>
    <type>
      <types>EnumRef.вмс_СкладскиеПотоки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредопределенныеДанные</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазбиватьПоПомещениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДДокументы</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСКДЗаданияКладовщику</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>CatalogRef.вмс_ИсточникиДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоИнвентаризация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьДанныеСКД</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьКлассОперацииХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДДокументы</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСКДЗаданияКладовщику</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Распоряжения</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СсылкаНаРаспоряжение</name>
      <type>
        <types>CatalogRef.вмс_РаспоряженияОпераций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭтапыОперации</name>
    <attributes>
      <name>Этап</name>
      <type>
        <types>CatalogRef.вмс_ЭтапыОперации</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <type>
        <types>CatalogRef.вмс_СтатусыДокументов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваОперации</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_СвойстваОпераций</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтветственноеХранение</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_УслугиОтветственногоХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.вмс_ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПочтовыеРассылки</name>
    <attributes>
      <name>Рассылка</name>
      <type>
        <types>CatalogRef.вмс_ПочтовыеРассылки</types>
      </type>
    </attributes>
    <attributes>
      <name>Активная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Алгоритмы</name>
    <attributes>
      <name>Алгоритм</name>
      <type>
        <types>CatalogRef.вмс_Алгоритмы</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриСохранении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриЗавершении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПравилоКонвертации</name>
      <type>
        <types>CatalogRef.вмс_ПравилаКонвертацииРеквизитов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОбработкиПередЗавершением</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Обработка</name>
      <type>
        <types>CatalogRef.вмс_ИнтерфейсыТСД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОперацииПлана</name>
    <attributes>
      <name>Операция</name>
      <type>
        <types>CatalogRef.вмс_Операции</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПараметрыОперации</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>НаФронтенде</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НаБэкенде</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ФормыОперации</name>
    <attributes>
      <name>МакетФормы</name>
      <type>
        <types>CatalogRef.вмс_ИнтерфейсыТСД</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МетодыОперации</name>
    <attributes>
      <name>ИмяМетода</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НормыKPI</name>
    <attributes>
      <name>КоличествоМинут</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЕдиниц</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>EnumRef.вмс_ЕдиницыИзмеренияKPI</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP DEV.WMS/src/CommonModules/вмс_ПодпиткаВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ВыполнитьПодпиткуНаЯчейках(ПараметрыПодпитки = Неопределено) Экспорт

	Если ПараметрыПодпитки = Неопределено Тогда
		ПараметрыПодпитки = ИнициализироватьПараметрыПодпитки();
	КонецЕсли;
	
	ПравилоЗаполненияЗадачиКладовщику = Справочники.вмс_ПравилаЗаполненияЗадачиКладовщику.ПолучитьЭлементСправочникаОперацииПоИмени("Подпитка");  	
	Если НЕ ЗначениеЗаполнено(ПравилоЗаполненияЗадачиКладовщику) Тогда
		Возврат Ложь;	
	КонецЕсли;
	
	Результат = ПолучитьДефицитТовараНаЗонахБыстрогоДоступа(ПараметрыПодпитки, ПравилоЗаполненияЗадачиКладовщику);   
	
	ТаблицаДефицитаОбщая = Результат.ТаблицаДефицитаОбщая;  
	ТаблицаДефицитаПоЗонам = Результат.ТаблицаДефицитаПоЗонам; 
	МассивЗонДоступа = Результат.МассивЗонДоступа;
	 
	РК = вмс_РаботаСКоллекциями;
	Если ТаблицаДефицитаОбщая.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;         
	
	ПравилоПодпитки = ПодготовитьПараметрыПодпитки(ПравилоЗаполненияЗадачиКладовщику);
	МассивСтрокОтбора = Новый Массив; 
	ТаблицаЯчеекЗонДоступа = ПолучитьТаблицуЯчеекЗоныДоступа(МассивЗонДоступа);     
	ОперацияПодпитка  = Справочники.вмс_Операции.ПолучитьЭлементСправочникаОперацииПоИмени("Подпитка");
	
	Если ПравилоПодпитки.ПодбиратьЯчейкиПоСкладам Тогда
		МассивСтрокОтбора.Добавить("Склад"); 
	КонецЕсли;          
	
	Если ПравилоПодпитки.ОтбиратьПоПомещениям Тогда
		МассивСтрокОтбора.Добавить("Помещение"); 
	КонецЕсли;           
	
	Если МассивСтрокОтбора.Количество() > 0 Тогда    
		ПравилаСтрокой = РК.МассивВСтроку(МассивСтрокОтбора);
		
		ТаблицаОтборовПоПравилу = ТаблицаДефицитаОбщая.Скопировать();
		ТаблицаОтборовПоПравилу.Свернуть(ПравилаСтрокой);    
		
		Для Каждого СтрокаПравила Из ТаблицаОтборовПоПравилу Цикл    
			Отбор = Новый Структура(ПравилаСтрокой); 
			ЗаполнитьЗначенияСвойств(Отбор, СтрокаПравила); 
			
			НайденныеСтрокиОбщие = ТаблицаДефицитаОбщая.НайтиСтроки(Отбор);    
			
			Если НайденныеСтрокиОбщие.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;        
			
			Если ПараметрыПодпитки.ПроверятьЗавершениеПоследнейПодпитки Тогда 
				Если НЕ ПоследняяПодпиткаЗавершена(ОперацияПодпитка,Отбор) Тогда			
					Продолжить;
				КонецЕсли;		
			КонецЕсли;             
					
			НайденныеСтрокиПоЗонам = ТаблицаДефицитаПоЗонам.НайтиСтроки(Отбор);  
			НайденныеЯчейкиЗонДоступа = ТаблицаЯчеекЗонДоступа.НайтиСтроки(Отбор);
			
			НачатьФормированиеЗаданийНаПодпитку(ПравилоПодпитки, НайденныеСтрокиОбщие,НайденныеСтрокиПоЗонам, НайденныеЯчейкиЗонДоступа, Отбор);			
			
		КонецЦикла;	
	Иначе   
		// В таком случае предполагается что все остатки по вмс ведутся по одному складу и на всех ячейках вмс - один склад
		// по сути ничем не отличается если по вмс один склад и стоит галочка "по складам"
		ДанныеОтбора = Новый Структура("Склад", ТаблицаДефицитаПоЗонам[0].Склад);           
		Если ПараметрыПодпитки.ПроверятьЗавершениеПоследнейПодпитки Тогда 
			Если НЕ ПоследняяПодпиткаЗавершена(ОперацияПодпитка,ДанныеОтбора) Тогда			
				Возврат Ложь;
			КонецЕсли;		
		КонецЕсли; 
		НачатьФормированиеЗаданийНаПодпитку(ПравилоПодпитки, ТаблицаДефицитаОбщая,ТаблицаДефицитаПоЗонам, ТаблицаЯчеекЗонДоступа, ДанныеОтбора);
	КонецЕсли;  
	
КонецФункции

Функция ИнициализироватьПараметрыПодпитки() Экспорт  
	
	Перем ПараметрыЗаполения;
	
	ПараметрыПодпитки = Новый Структура;
	ПараметрыПодпитки.Вставить("ТаблицаТоваров", Неопределено);
	ПараметрыПодпитки.Вставить("МассивЗонДоступа", Неопределено);  
	ПараметрыПодпитки.Вставить("МассивСкладов", Неопределено); 
	ПараметрыПодпитки.Вставить("МассивПомещений", Неопределено);   
	// Данный параметр служит для того, чтобы не создавать новое задание на подпитку, если последнее еще не выполнено
	ПараметрыПодпитки.Вставить("ПроверятьЗавершениеПоследнейПодпитки", Истина);
	
	Возврат ПараметрыПодпитки; 
	
КонецФункции

Функция ПодготовитьПараметрыПодпитки(ПараметрыЗаполнения); 
	
	Правило = Новый Структура;
	
	Для Каждого Реквизит Из Метаданные.Справочники.вмс_ПравилаЗаполненияЗадачиКладовщику.Реквизиты Цикл
		Правило.Вставить(Реквизит.Имя);
	КонецЦикла;
	
	ЗаполнитьЗначенияСвойств(Правило, ПараметрыЗаполнения);
	
	Правило.Вставить("ПодбиратьЯчейкиПоСкладам", ПараметрыЗаполнения.Подпитка_ПодбиратьЯчейкиПоСкладам);
	Правило.Вставить("ОтбиратьПоПомещениям", ПараметрыЗаполнения.Подпитка_ПодбиратьЯчейкиПоПомещениям);
	Правило.Вставить("ИспользоватьОСГНаОтбор", ПараметрыЗаполнения.Подпитка_ИспользоватьОСГНаОтбор);    
	Правило.Вставить("ОбъединятьВОдноЗадание", ПараметрыЗаполнения.Подпитка_ОбъединятьВОдноЗадание);
	
	Возврат Правило; 
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс 

Функция ПолучитьДефицитТовараНаЗонахБыстрогоДоступа(ПараметрыПодпитки, ПравилоПодпитки)   
	
	ТаблицаТоваров = ПараметрыПодпитки.ТаблицаТоваров;
	МассивЗонДоступа = ПараметрыПодпитки.МассивЗонДоступа; 
	МассивСкладов = ПараметрыПодпитки.МассивСкладов;  
	МассивПомещений = ПараметрыПодпитки.МассивПомещений;
	
	лТекст = "  
		|	&ТекстЗапросаТаблицыТоваров
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вмс_ЯчейкиПоЗонамБыстрогоДоступа.Ячейка КАК Ячейка,
		|	вмс_ЯчейкиПоЗонамБыстрогоДоступа.ЗонаДоступа КАК ЗонаДоступа
		|ПОМЕСТИТЬ ВТ_ЯчейкиПоЗонамБыстрогоДоступа
		|ИЗ
		|	РегистрСведений.вмс_ЯчейкиПоЗонамБыстрогоДоступа КАК вмс_ЯчейкиПоЗонамБыстрогоДоступа   
		| ГДЕ
		| 	ИСТИНА
		| &УсловиеОтбораЯчеекЗонДоступа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вмс_МинОстаткиПоЗонамБыстрогоДоступа.Товар КАК Товар,
		|	вмс_МинОстаткиПоЗонамБыстрогоДоступа.ЗонаДоступа КАК ЗонаДоступа,
		|	вмс_МинОстаткиПоЗонамБыстрогоДоступа.МинимальныйОстаток КАК МинимальныйОстаток,
		|	вмс_МинОстаткиПоЗонамБыстрогоДоступа.ЗонаДоступа.Склад КАК Склад,
		|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
		|	вмс_МинОстаткиПоЗонамБыстрогоДоступа.Товар.ВесЧислитель КАК ВесЕдиницыТовара,
		|	вмс_МинОстаткиПоЗонамБыстрогоДоступа.Товар.ОбъемЧислитель КАК ОбъемЕдиницыТовара,
		|	вмс_МинОстаткиПоЗонамБыстрогоДоступа.Характеристика КАК Характеристика,
		|	вмс_МинОстаткиПоЗонамБыстрогоДоступа.ЗонаДоступа.Помещение КАК Помещение
		|ПОМЕСТИТЬ ВТ_МинимальныйОстатокПоЗонам
		|ИЗ 
		|	&УсловиеСоединенияТаблицыТоваров
		|   ГДЕ
		| 	ИСТИНА
		| 	&УсловиеОтбораМинОстатковЗонДоступа
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	вмс_ОперацияПоЯчейкамОстатки.Товар КАК Товар,
		|	СУММА(ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток,
		|	ВТ_ЯчейкиПоЗонамБыстрогоДоступа.ЗонаДоступа КАК ЗонаДоступа,
		|	вмс_ОперацияПоЯчейкамОстатки.Ячейка.Владелец КАК Склад,
		|	вмс_ОперацияПоЯчейкамОстатки.Характеристика КАК Характеристика,
		|	вмс_ОперацияПоЯчейкамОстатки.Серия КАК Серия
		|ПОМЕСТИТЬ ВТ_ТекущийОстатокНаЗонах
		|ИЗ
		|	ВТ_ЯчейкиПоЗонамБыстрогоДоступа КАК ВТ_ЯчейкиПоЗонамБыстрогоДоступа
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки КАК вмс_ОперацияПоЯчейкамОстатки
		|		ПО ВТ_ЯчейкиПоЗонамБыстрогоДоступа.Ячейка = вмс_ОперацияПоЯчейкамОстатки.Ячейка
		|ГДЕ
		|	НЕ вмс_ОперацияПоЯчейкамОстатки.Товар ЕСТЬ NULL
		|
		|СГРУППИРОВАТЬ ПО
		|	вмс_ОперацияПоЯчейкамОстатки.Товар,
		|	ВТ_ЯчейкиПоЗонамБыстрогоДоступа.ЗонаДоступа,
		|	вмс_ОперацияПоЯчейкамОстатки.Ячейка.Владелец,
		|	вмс_ОперацияПоЯчейкамОстатки.Характеристика,
		|	вмс_ОперацияПоЯчейкамОстатки.Серия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_МинимальныйОстатокПоЗонам.МинимальныйОстаток - ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.КоличествоОстаток, 0)) КАК Количество,
		|	ВТ_МинимальныйОстатокПоЗонам.Товар КАК Номенклатура,
		|	ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.Склад, ВТ_МинимальныйОстатокПоЗонам.Склад) КАК Склад,
		|	ВТ_МинимальныйОстатокПоЗонам.Упаковка КАК Упаковка,
		|	МАКСИМУМ(ВТ_МинимальныйОстатокПоЗонам.ВесЕдиницыТовара) КАК ВесЕдиницыТовара,
		|	МАКСИМУМ(ВТ_МинимальныйОстатокПоЗонам.ОбъемЕдиницыТовара) КАК ОбъемЕдиницыТовара,
		|	ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.Серия, ЗНАЧЕНИЕ(Справочник.вмс_СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
		|	ВТ_МинимальныйОстатокПоЗонам.Характеристика КАК Характеристика,
		|	ВТ_МинимальныйОстатокПоЗонам.Помещение КАК Помещение   
		|ПОМЕСТИТЬ ТаблицаДефицитаОбщая
		|ИЗ
		|	ВТ_МинимальныйОстатокПоЗонам КАК ВТ_МинимальныйОстатокПоЗонам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущийОстатокНаЗонах КАК ВТ_ТекущийОстатокНаЗонах
		|		ПО ВТ_МинимальныйОстатокПоЗонам.Товар = ВТ_ТекущийОстатокНаЗонах.Товар
		|			И ВТ_МинимальныйОстатокПоЗонам.ЗонаДоступа = ВТ_ТекущийОстатокНаЗонах.ЗонаДоступа
		|ГДЕ
		|	ВТ_МинимальныйОстатокПоЗонам.МинимальныйОстаток > ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.КоличествоОстаток, 0)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВТ_МинимальныйОстатокПоЗонам.Товар,
		|	ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.Склад, ВТ_МинимальныйОстатокПоЗонам.Склад),
		|	ВТ_МинимальныйОстатокПоЗонам.Упаковка,
		|	ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.Серия, ЗНАЧЕНИЕ(Справочник.вмс_СерииНоменклатуры.ПустаяСсылка)),
		|	ВТ_МинимальныйОстатокПоЗонам.Характеристика,
		|	ВТ_МинимальныйОстатокПоЗонам.Помещение
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_МинимальныйОстатокПоЗонам.МинимальныйОстаток - ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.КоличествоОстаток, 0) КАК Количество,
		|	ВТ_МинимальныйОстатокПоЗонам.Товар КАК Номенклатура,
		|	ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.Склад, ВТ_МинимальныйОстатокПоЗонам.Склад) КАК Склад,
		|	ВТ_МинимальныйОстатокПоЗонам.Упаковка КАК Упаковка,
		|	ВТ_МинимальныйОстатокПоЗонам.ВесЕдиницыТовара КАК ВесЕдиницыТовара,
		|	ВТ_МинимальныйОстатокПоЗонам.ОбъемЕдиницыТовара КАК ОбъемЕдиницыТовара,
		|	ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.Серия, ЗНАЧЕНИЕ(Справочник.вмс_СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
		|	ВТ_МинимальныйОстатокПоЗонам.Характеристика КАК Характеристика,
		|	ВТ_МинимальныйОстатокПоЗонам.Помещение КАК Помещение,
		|	ВТ_МинимальныйОстатокПоЗонам.ЗонаДоступа КАК ЗонаДоступа 
		|ПОМЕСТИТЬ ТаблицаДефицитаПоЗонам
		|ИЗ
		|	ВТ_МинимальныйОстатокПоЗонам КАК ВТ_МинимальныйОстатокПоЗонам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущийОстатокНаЗонах КАК ВТ_ТекущийОстатокНаЗонах
		|		ПО ВТ_МинимальныйОстатокПоЗонам.Товар = ВТ_ТекущийОстатокНаЗонах.Товар
		|			И ВТ_МинимальныйОстатокПоЗонам.ЗонаДоступа = ВТ_ТекущийОстатокНаЗонах.ЗонаДоступа
		|ГДЕ
		|	ВТ_МинимальныйОстатокПоЗонам.МинимальныйОстаток > ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.КоличествоОстаток, 0)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВТ_МинимальныйОстатокПоЗонам.ЗонаДоступа КАК ЗонаДоступа  
		|ПОМЕСТИТЬ ТаблицаЗон
		|ИЗ
		|	ВТ_МинимальныйОстатокПоЗонам КАК ВТ_МинимальныйОстатокПоЗонам
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущийОстатокНаЗонах КАК ВТ_ТекущийОстатокНаЗонах
		|		ПО ВТ_МинимальныйОстатокПоЗонам.Товар = ВТ_ТекущийОстатокНаЗонах.Товар
		|			И ВТ_МинимальныйОстатокПоЗонам.ЗонаДоступа = ВТ_ТекущийОстатокНаЗонах.ЗонаДоступа
		|ГДЕ
		|	ВТ_МинимальныйОстатокПоЗонам.МинимальныйОстаток > ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.КоличествоОстаток, 0)
		|";

	лЗапрос = Новый Запрос(лТекст);
	лЗапрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Если ТаблицаТоваров <> Неопределено Тогда
		лЗапрос.Текст = СтрЗаменить(лЗапрос.Текст, "&ТекстЗапросаТаблицыТоваров", "ВЫБРАТЬ
		|	ТаблицаТоваров.Товар КАК Товар,
		|	ТаблицаТоваров.Характеристика КАК Характеристика
		|ПОМЕСТИТЬ ВТ_ТаблицаТоваров
		|ИЗ
		|	&ТаблицаТоваров КАК ТаблицаТоваров
		|;");
		
		лЗапрос.Текст = СтрЗаменить(лЗапрос.Текст, "&УсловиеСоединенияТаблицыТоваров", "ВТ_ТаблицаТоваров КАК ВТ_ТаблицаТоваров
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вмс_МинОстаткиПоЗонамБыстрогоДоступа КАК вмс_МинОстаткиПоЗонамБыстрогоДоступа
		|		ПО (ВТ_ТаблицаТоваров.Товар = вмс_МинОстаткиПоЗонамБыстрогоДоступа.Товар
		|				И ВТ_ТаблицаТоваров.Характеристика = вмс_МинОстаткиПоЗонамБыстрогоДоступа.Характеристика)");
		
		лЗапрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
	Иначе    
		лЗапрос.Текст = СтрЗаменить(лЗапрос.Текст, "&ТекстЗапросаТаблицыТоваров", "");
		лЗапрос.Текст = СтрЗаменить(лЗапрос.Текст, "&УсловиеСоединенияТаблицыТоваров", "РегистрСведений.вмс_МинОстаткиПоЗонамБыстрогоДоступа КАК вмс_МинОстаткиПоЗонамБыстрогоДоступа")
	КонецЕсли;      
	УсловиеОтбораЯчеекЗонДоступа = "";  
	УсловиеОтбораМинОстатковЗонДоступа = "";  
	Если МассивЗонДоступа <> Неопределено Тогда   
		УсловиеОтбораЯчеекЗонДоступа = УсловиеОтбораЯчеекЗонДоступа + " И вмс_ЯчейкиПоЗонамБыстрогоДоступа.ЗонаДоступа В(&СписокЗон)"; 
		УсловиеОтбораМинОстатковЗонДоступа = УсловиеОтбораМинОстатковЗонДоступа + " И вмс_МинОстаткиПоЗонамБыстрогоДоступа.ЗонаДоступа В (&СписокЗон)";
		лЗапрос.УстановитьПараметр("СписокЗон", МассивЗонДоступа);
	КонецЕсли; 
	
	Если МассивСкладов <> Неопределено Тогда  
		УсловиеОтбораЯчеекЗонДоступа = УсловиеОтбораЯчеекЗонДоступа + " И вмс_ЯчейкиПоЗонамБыстрогоДоступа.Ячейка.Владелец В (&СписокСкладов)"; 
		УсловиеОтбораМинОстатковЗонДоступа = УсловиеОтбораМинОстатковЗонДоступа + " И вмс_МинОстаткиПоЗонамБыстрогоДоступа.ЗонаДоступа.Склад В (&СписокСкладов)";  
		лЗапрос.УстановитьПараметр("СписокСкладов", МассивСкладов);
	КонецЕсли;  
	
	Если МассивПомещений <> Неопределено Тогда  
		УсловиеОтбораЯчеекЗонДоступа = УсловиеОтбораЯчеекЗонДоступа + " И вмс_ЯчейкиПоЗонамБыстрогоДоступа.Ячейка.Помещение В (&СписокПомещений)"; 
		УсловиеОтбораМинОстатковЗонДоступа = УсловиеОтбораМинОстатковЗонДоступа + " И вмс_МинОстаткиПоЗонамБыстрогоДоступа.ЗонаДоступа.Помещение В (&СписокПомещений)";  
		лЗапрос.УстановитьПараметр("СписокПомещений", МассивПомещений);
	КонецЕсли; 
	
	лЗапрос.Текст = СтрЗаменить(лЗапрос.Текст, "&УсловиеОтбораЯчеекЗонДоступа",УсловиеОтбораЯчеекЗонДоступа);	
	лЗапрос.Текст = СтрЗаменить(лЗапрос.Текст, "&УсловиеОтбораМинОстатковЗонДоступа", УсловиеОтбораМинОстатковЗонДоступа);     
		
	ПакетРезультатов = лЗапрос.ВыполнитьПакет();
	
	ТаблицаДефицитаОбщая = лЗапрос.МенеджерВременныхТаблиц.Таблицы.Найти("ТаблицаДефицитаОбщая").ПолучитьДанные().Выгрузить();  
	ТаблицаДефицитаПоЗонам = лЗапрос.МенеджерВременныхТаблиц.Таблицы.Найти("ТаблицаДефицитаПоЗонам").ПолучитьДанные().Выгрузить();
	ТаблицаЗон = лЗапрос.МенеджерВременныхТаблиц.Таблицы.Найти("ТаблицаЗон").ПолучитьДанные().Выгрузить();
	РК = вмс_РаботаСКоллекциями;
	Если НЕ ПравилоПодпитки.Подпитка_ПодбиратьЯчейкиПоПомещениям Тогда
		КолонкиОбщейТаблицы = РК.ПолучитьКолонкиКоллекции(ТаблицаДефицитаОбщая);
		РК.УдалитьЭлементыКоллекции(КолонкиОбщейТаблицы, "Помещение"); 
		РК.УдалитьЭлементыКоллекции(КолонкиОбщейТаблицы, "Количество");
        ТаблицаДефицитаОбщая.Свернуть(РК.МассивВСтроку(КолонкиОбщейТаблицы), "Количество");		
	КонецЕсли;	  
	
	Если НЕ ПравилоПодпитки.Подпитка_ПодбиратьЯчейкиПоСкладам Тогда
		КолонкиОбщейТаблицы = РК.ПолучитьКолонкиКоллекции(ТаблицаДефицитаОбщая);
		РК.УдалитьЭлементыКоллекции(КолонкиОбщейТаблицы, "Склад"); 
		РК.УдалитьЭлементыКоллекции(КолонкиОбщейТаблицы, "Количество");
        ТаблицаДефицитаОбщая.Свернуть(РК.МассивВСтроку(КолонкиОбщейТаблицы), "Количество");		
	КонецЕсли;
	
	Результат = Новый Структура("ТаблицаДефицитаОбщая,ТаблицаДефицитаПоЗонам, МассивЗонДоступа", ТаблицаДефицитаОбщая,ТаблицаДефицитаПоЗонам, ТаблицаЗон.ВыгрузитьКолонку("ЗонаДоступа"));  
	
	Возврат Результат;

	// запрос без параметров для тестирования 
	//лТекст = "
	//	|ВЫБРАТЬ
	//	|	вмс_ЯчейкиПоЗонамБыстрогоДоступа.Ячейка КАК Ячейка,
	//	|	вмс_ЯчейкиПоЗонамБыстрогоДоступа.ЗонаДоступа КАК ЗонаДоступа
	//	|ПОМЕСТИТЬ ВТ_ЯчейкиПоЗонамБыстрогоДоступа
	//	|ИЗ
	//	|	РегистрСведений.вмс_ЯчейкиПоЗонамБыстрогоДоступа КАК вмс_ЯчейкиПоЗонамБыстрогоДоступа
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	вмс_МинОстаткиПоЗонамБыстрогоДоступа.Товар КАК Товар,
	//	|	вмс_МинОстаткиПоЗонамБыстрогоДоступа.ЗонаДоступа КАК ЗонаДоступа,
	//	|	вмс_МинОстаткиПоЗонамБыстрогоДоступа.МинимальныйОстаток КАК МинимальныйОстаток,
	//	|	вмс_МинОстаткиПоЗонамБыстрогоДоступа.ЗонаДоступа.Склад КАК Склад,
	//	|	ЗНАЧЕНИЕ(Справочник.УпаковкиЕдиницыИзмерения.ПустаяСсылка) КАК Упаковка,
	//	|	вмс_МинОстаткиПоЗонамБыстрогоДоступа.Товар.ВесЧислитель КАК ВесЕдиницыТовара,
	//	|	вмс_МинОстаткиПоЗонамБыстрогоДоступа.Товар.ОбъемЧислитель КАК ОбъемЕдиницыТовара,
	//	|	вмс_МинОстаткиПоЗонамБыстрогоДоступа.Характеристика КАК Характеристика,
	//	|	вмс_МинОстаткиПоЗонамБыстрогоДоступа.ЗонаДоступа.Помещение КАК Помещение
	//	|ПОМЕСТИТЬ ВТ_МинимальныйОстатокПоЗонам
	//	|ИЗ
	//	|	РегистрСведений.вмс_МинОстаткиПоЗонамБыстрогоДоступа КАК вмс_МинОстаткиПоЗонамБыстрогоДоступа
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	вмс_ОперацияПоЯчейкамОстатки.Товар КАК Товар,
	//	|	СУММА(ЕСТЬNULL(вмс_ОперацияПоЯчейкамОстатки.КоличествоОстаток, 0)) КАК КоличествоОстаток,
	//	|	ВТ_ЯчейкиПоЗонамБыстрогоДоступа.ЗонаДоступа КАК ЗонаДоступа,
	//	|	вмс_ОперацияПоЯчейкамОстатки.Склад КАК Склад,
	//	|	вмс_ОперацияПоЯчейкамОстатки.Характеристика КАК Характеристика,
	//	|	вмс_ОперацияПоЯчейкамОстатки.Серия КАК Серия
	//	|ПОМЕСТИТЬ ВТ_ТекущийОстатокНаЗонах
	//	|ИЗ
	//	|	ВТ_ЯчейкиПоЗонамБыстрогоДоступа КАК ВТ_ЯчейкиПоЗонамБыстрогоДоступа
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.вмс_ОперацияПоЯчейкам.Остатки КАК вмс_ОперацияПоЯчейкамОстатки
	//	|		ПО ВТ_ЯчейкиПоЗонамБыстрогоДоступа.Ячейка = вмс_ОперацияПоЯчейкамОстатки.Ячейка
	//	|ГДЕ
	//	|	НЕ вмс_ОперацияПоЯчейкамОстатки.Товар ЕСТЬ NULL
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	вмс_ОперацияПоЯчейкамОстатки.Товар,
	//	|	ВТ_ЯчейкиПоЗонамБыстрогоДоступа.ЗонаДоступа,
	//	|	вмс_ОперацияПоЯчейкамОстатки.Склад,
	//	|	вмс_ОперацияПоЯчейкамОстатки.Характеристика,
	//	|	вмс_ОперацияПоЯчейкамОстатки.Серия
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	СУММА(ВТ_МинимальныйОстатокПоЗонам.МинимальныйОстаток - ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.КоличествоОстаток, 0)) КАК Количество,
	//	|	ВТ_МинимальныйОстатокПоЗонам.Товар КАК Номенклатура,
	//	|	ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.Склад, ВТ_МинимальныйОстатокПоЗонам.Склад) КАК Склад,
	//	|	ВТ_МинимальныйОстатокПоЗонам.Упаковка КАК Упаковка,
	//	|	МАКСИМУМ(ВТ_МинимальныйОстатокПоЗонам.ВесЕдиницыТовара) КАК ВесЕдиницыТовара,
	//	|	МАКСИМУМ(ВТ_МинимальныйОстатокПоЗонам.ОбъемЕдиницыТовара) КАК ОбъемЕдиницыТовара,
	//	|	ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.Серия, ЗНАЧЕНИЕ(Справочник.вмс_СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	//	|	ВТ_МинимальныйОстатокПоЗонам.Характеристика КАК Характеристика,
	//	|	ВТ_МинимальныйОстатокПоЗонам.Помещение КАК Помещение
	//	|ИЗ
	//	|	ВТ_МинимальныйОстатокПоЗонам КАК ВТ_МинимальныйОстатокПоЗонам
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущийОстатокНаЗонах КАК ВТ_ТекущийОстатокНаЗонах
	//	|		ПО ВТ_МинимальныйОстатокПоЗонам.Товар = ВТ_ТекущийОстатокНаЗонах.Товар
	//	|			И ВТ_МинимальныйОстатокПоЗонам.ЗонаДоступа = ВТ_ТекущийОстатокНаЗонах.ЗонаДоступа
	//	|ГДЕ
	//	|	ВТ_МинимальныйОстатокПоЗонам.МинимальныйОстаток > ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.КоличествоОстаток, 0)
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	ВТ_МинимальныйОстатокПоЗонам.Товар,
	//	|	ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.Склад, ВТ_МинимальныйОстатокПоЗонам.Склад),
	//	|	ВТ_МинимальныйОстатокПоЗонам.Упаковка,
	//	|	ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.Серия, ЗНАЧЕНИЕ(Справочник.вмс_СерииНоменклатуры.ПустаяСсылка)),
	//	|	ВТ_МинимальныйОстатокПоЗонам.Характеристика,
	//	|	ВТ_МинимальныйОстатокПоЗонам.Помещение
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ
	//	|	ВТ_МинимальныйОстатокПоЗонам.МинимальныйОстаток - ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.КоличествоОстаток, 0) КАК Количество,
	//	|	ВТ_МинимальныйОстатокПоЗонам.Товар КАК Номенклатура,
	//	|	ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.Склад, ВТ_МинимальныйОстатокПоЗонам.Склад) КАК Склад,
	//	|	ВТ_МинимальныйОстатокПоЗонам.Упаковка КАК Упаковка,
	//	|	ВТ_МинимальныйОстатокПоЗонам.ВесЕдиницыТовара КАК ВесЕдиницыТовара,
	//	|	ВТ_МинимальныйОстатокПоЗонам.ОбъемЕдиницыТовара КАК ОбъемЕдиницыТовара,
	//	|	ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.Серия, ЗНАЧЕНИЕ(Справочник.вмс_СерииНоменклатуры.ПустаяСсылка)) КАК Серия,
	//	|	ВТ_МинимальныйОстатокПоЗонам.Характеристика КАК Характеристика,
	//	|	ВТ_МинимальныйОстатокПоЗонам.Помещение КАК Помещение,
	//	|	ВТ_МинимальныйОстатокПоЗонам.ЗонаДоступа КАК ЗонаДоступа
	//	|ИЗ
	//	|	ВТ_МинимальныйОстатокПоЗонам КАК ВТ_МинимальныйОстатокПоЗонам
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущийОстатокНаЗонах КАК ВТ_ТекущийОстатокНаЗонах
	//	|		ПО (ВТ_МинимальныйОстатокПоЗонам.Товар = ВТ_ТекущийОстатокНаЗонах.Товар)
	//	|			И (ВТ_МинимальныйОстатокПоЗонам.ЗонаДоступа = ВТ_ТекущийОстатокНаЗонах.ЗонаДоступа)
	//	|ГДЕ
	//	|	ВТ_МинимальныйОстатокПоЗонам.МинимальныйОстаток > ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.КоличествоОстаток, 0)
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	//	|	ВТ_МинимальныйОстатокПоЗонам.ЗонаДоступа КАК ЗонаДоступа
	//	|ИЗ
	//	|	ВТ_МинимальныйОстатокПоЗонам КАК ВТ_МинимальныйОстатокПоЗонам
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТекущийОстатокНаЗонах КАК ВТ_ТекущийОстатокНаЗонах
	//	|		ПО (ВТ_МинимальныйОстатокПоЗонам.Товар = ВТ_ТекущийОстатокНаЗонах.Товар)
	//	|			И (ВТ_МинимальныйОстатокПоЗонам.ЗонаДоступа = ВТ_ТекущийОстатокНаЗонах.ЗонаДоступа)
	//	|ГДЕ
	//	|	ВТ_МинимальныйОстатокПоЗонам.МинимальныйОстаток > ЕСТЬNULL(ВТ_ТекущийОстатокНаЗонах.КоличествоОстаток, 0)
	//	|";

	//лЗапрос = Новый Запрос(лТекст);
	//лЗапрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;

	//ПакетРезультатов = лЗапрос.ВыполнитьПакет();

	//ТаблицаДефицитаОбщая = ПакетРезультатов[3].Выгрузить();  
	//ТаблицаДефицитаПоЗонам = ПакетРезультатов[4].Выгрузить();
	//ТаблицаЗон = ПакетРезультатов[5].Выгрузить();
	//
	//Результат = Новый Структура("ТаблицаДефицитаОбщая,ТаблицаДефицитаПоЗонам, МассивЗонДоступа", ТаблицаДефицитаОбщая,ТаблицаДефицитаПоЗонам, ТаблицаЗон.ВыгрузитьКолонку("ЗонаДоступа"));  
	//
	//Возврат Результат;
	
КонецФункции

Функция НачатьФормированиеЗаданийНаПодпитку(ПравилоПодпитки, ПланПодпитки,ПланПодпиткиПоЗонам, ТаблицаЯчеекНаРазмещение, ДетальныеДанныеПодпитки)    
	
	РК = вмс_РаботаСКоллекциями;
	МассивЗонДоступа = РК.ВыгрузитьЗначенияКолонкиКоллекции(ПланПодпиткиПоЗонам, "ЗонаДоступа");
	РК.УдалитьДублиВМассиве(МассивЗонДоступа);   
	//ОперацияОтбор = Справочники.вмс_Операции.ПолучитьЭлементСправочникаОперацииПоИмени("Отбор");   
	//ОперацияРазмещение = Справочники.вмс_Операции.ПолучитьЭлементСправочникаОперацииПоИмени("Размещение");
	ОперацияПодпитка  = Справочники.вмс_Операции.ПолучитьЭлементСправочникаОперацииПоИмени("Подпитка");
	
	ТаблицаТоваровНаОтбор = ПодготовитьТаблицуТовараНаОтбор(ПравилоПодпитки, ПланПодпитки,ПланПодпиткиПоЗонам, ДетальныеДанныеПодпитки);  
	Если ТаблицаТоваровНаОтбор.Количество() = 0 Тогда 
		// Нет остатков чтобы отобрать товар
		Возврат Ложь;	
	КонецЕсли;	
	
	Если НЕ ПравилоПодпитки.ОбъединятьВОдноЗадание Тогда      
		ДанныеЗаданиеКладовщику = ИнициализироватьДанныеЗаданияКладовщикаПодпитки();
		ДанныеЗаданиеКладовщику.ТаблицаТоваров = ТаблицаТоваровНаОтбор;  
		ДанныеЗаданиеКладовщику.ПравилоПодпитки = ПравилоПодпитки;
		ДанныеЗаданиеКладовщику.Операция = ОперацияПодпитка;
		ДанныеЗаданиеКладовщику.ДетальныеДанныеПодпитки = ДетальныеДанныеПодпитки;
		ДанныеЗаданиеКладовщику.МассивЗонДоступа = МассивЗонДоступа;     
		
		СформироватьЗаданиеНаПодпитку(ДанныеЗаданиеКладовщику);
		
		ТаблицаТоваровНаРазмещение = ПодготовитьТаблицуТовараНаРазмещение(ТаблицаТоваровНаОтбор, ПравилоПодпитки, ПланПодпиткиПоЗонам,ТаблицаЯчеекНаРазмещение, ДетальныеДанныеПодпитки);      
		
		ДанныеЗаданиеКладовщику = ИнициализироватьДанныеЗаданияКладовщикаПодпитки();
		ДанныеЗаданиеКладовщику.ТаблицаТоваров = ТаблицаТоваровНаРазмещение;  
		ДанныеЗаданиеКладовщику.ПравилоПодпитки = ПравилоПодпитки;
		ДанныеЗаданиеКладовщику.Операция = ОперацияПодпитка;
		ДанныеЗаданиеКладовщику.ДетальныеДанныеПодпитки = ДетальныеДанныеПодпитки;
		ДанныеЗаданиеКладовщику.МассивЗонДоступа = МассивЗонДоступа; 
		
		СформироватьЗаданиеНаПодпитку(ДанныеЗаданиеКладовщику);	
	Иначе    
		ТаблицаТоваровНаРазмещение = ПодготовитьТаблицуТовараНаРазмещение(ТаблицаТоваровНаОтбор, ПравилоПодпитки, ПланПодпиткиПоЗонам,ТаблицаЯчеекНаРазмещение, ДетальныеДанныеПодпитки);
		ОбщаяТаблицаПодпитки = СоединитьТаблицыТоваровНаОтборИРазмещение(ТаблицаТоваровНаОтбор, ТаблицаТоваровНаРазмещение);  
		
		ДанныеЗаданиеКладовщику = ИнициализироватьДанныеЗаданияКладовщикаПодпитки();
		ДанныеЗаданиеКладовщику.ТаблицаТоваров = ОбщаяТаблицаПодпитки;  
		ДанныеЗаданиеКладовщику.ПравилоПодпитки = ПравилоПодпитки;
		ДанныеЗаданиеКладовщику.Операция = ОперацияПодпитка;
		ДанныеЗаданиеКладовщику.ДетальныеДанныеПодпитки = ДетальныеДанныеПодпитки;
		ДанныеЗаданиеКладовщику.МассивЗонДоступа = МассивЗонДоступа; 
		
		СформироватьЗаданиеНаПодпитку(ДанныеЗаданиеКладовщику);
	КонецЕсли;
	
КонецФункции   

Функция ИнициализироватьДанныеЗаданияКладовщикаПодпитки()  
	
	Перем ДанныеЗаданияКладовщика;
	
	ДанныеЗаданияКладовщика = Новый Структура;
	ДанныеЗаданияКладовщика.Вставить("ТаблицаТоваров", Неопределено);  
	ДанныеЗаданияКладовщика.Вставить("ПравилоПодпитки", Неопределено);  
	ДанныеЗаданияКладовщика.Вставить("ДетальныеДанныеПодпитки", Неопределено); 
	ДанныеЗаданияКладовщика.Вставить("Операция", Неопределено);
	ДанныеЗаданияКладовщика.Вставить("МассивЗонДоступа", Новый Массив);   

    Возврат ДанныеЗаданияКладовщика;           
	
КонецФункции

Функция ПодготовитьТаблицуТовараНаРазмещение(ТаблицаТоваровНаОтбор, ПравилоПодпитки, ПланПодпиткиПоЗонам, СписокЯчеекНаРазмещение, ДетальныеДанныеПодпитки)  
	РК = вмс_РаботаСКоллекциями;
	
	ТаблицаТоваровНаРазмещение = ТаблицаТоваровНаОтбор.Скопировать();
	ТаблицаТоваровНаРазмещение.Колонки.Номенклатура.Имя = "Товар";
	КолонкиТоваровПодпитки = РК.ПолучитьКолонкиКоллекции(ТаблицаТоваровНаРазмещение);
	
	ПараметрыРазмещения = вмс_РазмещениеСервер.ПолучитьПустыеПараметрыДляПолученияЯчейкиПолучателя();
	ПараметрыРазмещения.Вставить("ЭтоПодпитка", Истина);
	
	КолонкиТоваровРазмещение = РК.ПолучитьКолонкиКоллекции(ПараметрыРазмещения.Товары);
	РК.УдалитьЭлементыКоллекции(КолонкиТоваровРазмещение, "Количество");
	
	// ТУ_Алфимов_16.07.2026 ++ 3.2.5
	Если ТаблицаТоваровНаРазмещение.Колонки.Найти("ОбъемТары") = Неопределено Тогда
		ТаблицаТоваровНаРазмещение.Колонки.Добавить("ОбъемТары", Новый ОписаниеТипов("Число"));
	КонецЕсли;
	// ТУ_Алфимов_16.07.2026 -- 3.2.5
	
	ТаблицаТоваровНаРазмещение.Свернуть(РК.МассивВСтроку(КолонкиТоваровРазмещение), "Количество");
	
	МассивЗонДоступа = РК.ВыгрузитьЗначенияКолонкиКоллекции(ПланПодпиткиПоЗонам, "ЗонаДоступа");
	РК.УдалитьДублиВМассиве(МассивЗонДоступа); 
	ОбщаяТаблицаРазмещения = Неопределено;
	
	ТранзитнаяЗона = вмс_СкладыВызовСервера.ПолучитьЗонуСклада(ДетальныеДанныеПодпитки.Склад, Перечисления.вмс_ТипыЯчеек.Транзит);
	
	Если МассивЗонДоступа.Количество() > 1 Тогда
		
		Для Каждого ЗонаДоступа Из МассивЗонДоступа Цикл
			ТаблицаТоваровНаРазмещениеПоЗонам = ТаблицаТоваровНаРазмещение.Скопировать();
			ТаблицаТоваровНаРазмещениеПоЗонам.Очистить();
			
			Отбор = Новый Структура("ЗонаДоступа", ЗонаДоступа);
			ПотребностьЗоны = РК.НайтиЭлементыКоллекции(ПланПодпиткиПоЗонам, Отбор);
			ЯчейкиЗоны = РК.НайтиЭлементыКоллекции(СписокЯчеекНаРазмещение, Отбор);
			МассивДопустимыхЯчеек = РК.ВыгрузитьЗначенияКолонкиКоллекции(ЯчейкиЗоны, "Ячейка");
			ПараметрыРазмещения.Вставить("ДопустимыеЯчейки",МассивДопустимыхЯчеек);
			
			Для Каждого СтрокаПотребностиЗоны Из ПотребностьЗоны Цикл
				ОтборТовара = Новый Структура("Товар, Характеристика, Серия", СтрокаПотребностиЗоны.Номенклатура, СтрокаПотребностиЗоны.Характеристика, СтрокаПотребностиЗоны.Серия);
				НайденнаяСтрока = ТаблицаТоваровНаРазмещение.НайтиСтроки(ОтборТовара);
				Если НЕ ЗначениеЗаполнено(НайденнаяСтрока) Тогда
					Продолжить;
				КонецЕсли;
				
				СтрокаОбщегоПланаНаРазмещение = НайденнаяСтрока[0];
				Если СтрокаПотребностиЗоны.Количество > СтрокаОбщегоПланаНаРазмещение.Количество Тогда
					РазмещаемоеКоличество = СтрокаОбщегоПланаНаРазмещение.Количество;
				Иначе
					РазмещаемоеКоличество = СтрокаПотребностиЗоны.Количество;
				КонецЕсли;
				СтрокаОбщегоПланаНаРазмещение.Количество = СтрокаОбщегоПланаНаРазмещение.Количество - РазмещаемоеКоличество;
				
				НоваяСтрока = ТаблицаТоваровНаРазмещениеПоЗонам.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока,СтрокаОбщегоПланаНаРазмещение);
				НоваяСтрока.Количество = РазмещаемоеКоличество;
			КонецЦикла;
			
			ПараметрыРазмещения.Товары = ТаблицаТоваровНаРазмещениеПоЗонам;
			ПараметрыРазмещения.Правило = ПравилоПодпитки;
			ПараметрыРазмещения.Склад = ДетальныеДанныеПодпитки.Склад;
			
			МаршрутРазмещения = вмс_РазмещениеСервер.ПодобратьЯчейкиПолучатели(ПараметрыРазмещения);
			
			КолонкиТаблицыНаРазмещение = РК.ПолучитьКолонкиКоллекции(ТаблицаТоваровНаРазмещениеПоЗонам);
			НедостающиеКолонки = РК.СкопироватьМассив(КолонкиТоваровПодпитки);
			РК.УдалитьЭлементыКоллекции(НедостающиеКолонки, КолонкиТаблицыНаРазмещение);
			
			Для Каждого Колонка Из НедостающиеКолонки Цикл
				ТаблицаТоваровНаРазмещениеПоЗонам.Колонки.Добавить(Колонка);
			КонецЦикла;
			
			ТаблицаТоваровНаРазмещениеПоЗонам.Колонки.Товар.Имя = "Номенклатура";

			ПодготовитьТаблицуТоваровНаРазмещениеДляЗадания(ТаблицаТоваровНаРазмещениеПоЗонам, МаршрутРазмещения);
			Если ОбщаяТаблицаРазмещения = Неопределено Тогда  
				ОбщаяТаблицаРазмещения = ТаблицаТоваровНаРазмещениеПоЗонам.Скопировать();
			Иначе
				РК.ДобавитьЭлементыКоллекции(ОбщаяТаблицаРазмещения, ТаблицаТоваровНаРазмещениеПоЗонам);
			КонецЕсли;
				
			ОтборНулевыхСтрок = Новый Структура("Количество", 0);
			РаспределенныеСтроки = ТаблицаТоваровНаРазмещение.НайтиСтроки(ОтборНулевыхСтрок);
			РК.УдалитьЭлементыКоллекции(ТаблицаТоваровНаРазмещение, РаспределенныеСтроки);
			
		КонецЦикла;
		
		РК.ЗаполнитьЗначенияКоллекции(ОбщаяТаблицаРазмещения, ТранзитнаяЗона, "Ячейка");
		РК.ЗаполнитьЗначенияКоллекции(ОбщаяТаблицаРазмещения, ДетальныеДанныеПодпитки.Склад, "Склад");
		РК.ЗаполнитьЗначенияКоллекции(ОбщаяТаблицаРазмещения, ТранзитнаяЗона, "ЯчейкаТранзит");
			
	Иначе
		ОбщаяТаблицаРазмещения = ТаблицаТоваровНаРазмещение.Скопировать();
		
		ПараметрыРазмещения.Товары = ОбщаяТаблицаРазмещения;
		ПараметрыРазмещения.Правило = ПравилоПодпитки;
		ПараметрыРазмещения.Склад = ДетальныеДанныеПодпитки.Склад;
		МассивДопустимыхЯчеек = РК.ВыгрузитьЗначенияКолонкиКоллекции(СписокЯчеекНаРазмещение, "Ячейка");
		ПараметрыРазмещения.Вставить("ДопустимыеЯчейки", МассивДопустимыхЯчеек);
			
		МаршрутРазмещения = вмс_РазмещениеСервер.ПодобратьЯчейкиПолучатели(ПараметрыРазмещения);
				
		КолонкиТаблицыНаРазмещение = РК.ПолучитьКолонкиКоллекции(ОбщаяТаблицаРазмещения);
		НедостающиеКолонки = РК.СкопироватьМассив(КолонкиТоваровПодпитки);
		РК.УдалитьЭлементыКоллекции(НедостающиеКолонки, КолонкиТаблицыНаРазмещение);
		
		Для Каждого Колонка Из НедостающиеКолонки Цикл
			ОбщаяТаблицаРазмещения.Колонки.Добавить(Колонка);
		КонецЦикла;
		
		ОбщаяТаблицаРазмещения.Колонки.Товар.Имя = "Номенклатура";
		
		ПодготовитьТаблицуТоваровНаРазмещениеДляЗадания(ОбщаяТаблицаРазмещения, МаршрутРазмещения);
		
		РК.ЗаполнитьЗначенияКоллекции(ОбщаяТаблицаРазмещения, ТранзитнаяЗона, "Ячейка");
		РК.ЗаполнитьЗначенияКоллекции(ОбщаяТаблицаРазмещения, ДетальныеДанныеПодпитки.Склад, "Склад");
		РК.ЗаполнитьЗначенияКоллекции(ОбщаяТаблицаРазмещения, ТранзитнаяЗона, "ЯчейкаТранзит");
		
	КонецЕсли;
	
	Возврат ОбщаяТаблицаРазмещения;
	
КонецФункции

Функция ПодготовитьТаблицуТовараНаОтбор(ПравилоПодпитки, ПланПодпитки,ПланПодпиткиПоЗонам, ДетальныеДанныеПодпитки)
	РК = вмс_РаботаСКоллекциями;      
	
	ТаблицаТоваров = ПодготовитьТаблицуТоваровДляПодитки(ПланПодпитки);
	ПараметрыЗаполненияОтбора = ПодготовитьПараметрыОтбораНаПодпитку(ПравилоПодпитки,ТаблицаТоваров, ДетальныеДанныеПодпитки);  
	
	МаршрутОтбора = вмс_ОтборСервер.ПодобратьЯчейкиОтправители(ПараметрыЗаполненияОтбора);  
	
	КолонкиТоваров = РК.ПолучитьКолонкиКоллекции(ТаблицаТоваров); 	
	КолонкиМаршрута = РК.ПолучитьКолонкиКоллекции(МаршрутОтбора); 
	РК.УдалитьЭлементыКоллекции(КолонкиМаршрута, "Товар");
	
	КолонкиТоваровПодпитки = РК.СложениеМассивов(КолонкиМаршрута, КолонкиТоваров);
	РК.УдалитьДублиВМассиве(КолонкиТоваровПодпитки); 	
	ОбязательныеКолонки = ПолучитьМассивОбязательныхКолонокЗаданияКладовщику();	 
	Для Каждого Колонка Из ОбязательныеКолонки Цикл
		КолонкиТоваровПодпитки.Добавить(Колонка);		
	КонецЦикла;
	
	ТаблицаТоваровОтбор = РК.НоваяТаблицаЗначений(КолонкиТоваровПодпитки);
	
	ТаблицаПланОтбора = ТаблицаТоваров.Скопировать();
	ТаблицаПланОтбора.Колонки.Добавить("Обработано", Новый ОписаниеТипов("Булево"));  
	
	Для Каждого СтрокаОтбора Из МаршрутОтбора Цикл   
		
		Отбор = Новый Структура("Номенклатура, Характеристика", СтрокаОтбора.Товар, СтрокаОтбора.Характеристика);
		НайденныеСтроки = ТаблицаПланОтбора.НайтиСтроки(Отбор); 
		
		Для Каждого СтрокаПлана Из НайденныеСтроки Цикл
			Если СтрокаПлана.Количество  <> 0 Тогда 				
				
				НоваяСтрока = ТаблицаТоваровОтбор.Добавить();  
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОтбора);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаПлана);
				НоваяСтрока.ИдентификаторИнструкции = 0;    
				НоваяСтрока.Серия = СтрокаОтбора.Серия;
				Если СтрокаПлана.Количество > СтрокаОтбора.СвободныйОстаток Тогда
					НоваяСтрока.Количество = СтрокаОтбора.СвободныйОстаток;   
					СтрокаПлана.Количество = СтрокаПлана.Количество - НоваяСтрока.Количество; 	
				Иначе   
					НоваяСтрока.Количество = СтрокаПлана.Количество; 
					СтрокаПлана.Количество = 0;
					СтрокаПлана.Обработано = Истина;
				КонецЕсли;	
			Иначе   
				НайденныеСтроки = ТаблицаТоваровОтбор.НайтиСтроки(Отбор);  
				Для Каждого Строка Из НайденныеСтроки Цикл      
					МассивДопЯчеек = РК.СтрокуВМассив(Строка.ДополнительныеЯчейки);
					МассивДопЯчеек.Добавить(СтрокаОтбора.Ячейка);
					Строка.ДополнительныеЯчейки = РК.МассивВСтроку(МассивДопЯчеек);   
				КонецЦикла;			
			КонецЕсли;
		КонецЦикла;		
		
	КонецЦикла;    
	
	ТаблицаТоваровОтбор.Сортировать("ПриоритетЗоны, Приоритет, Ячейка");  
	Операция = Справочники.вмс_Операции.ПолучитьЭлементСправочникаОперацииПоИмени("Отбор");   
	ТранзитнаяЗона = вмс_СкладыВызовСервера.ПолучитьЗонуСклада(ДетальныеДанныеПодпитки.Склад, Перечисления.вмс_ТипыЯчеек.Транзит);
	РК.ЗаполнитьЗначенияКоллекции(ТаблицаТоваровОтбор, ТранзитнаяЗона, "ЯчейкаПриемник"); 
	РК.ЗаполнитьЗначенияКоллекции(ТаблицаТоваровОтбор, ТранзитнаяЗона, "ЯчейкаТранзит"); 
	
	// Товар, которого нет на остатках чтобы подпитать+	
	ОтборНеОбработанного = Новый Структура("Обработано", Ложь);
	ТоварБезОстатка = ТаблицаПланОтбора.НайтиСтроки(ОтборНеОбработанного);
	
	//Для Каждого Строка Из ТоварБезОстатка Цикл
	//	НоваяСтрока = ЗаданиеКладовщику.Товары.Добавить();
	//	ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	//	НоваяСтрока.ИдентификаторИнструкции = 0; 
	//КонецЦикла;    
	
	// Товар, которого нет на остатках чтобы подпитать-  
	
	Возврат ТаблицаТоваровОтбор;
	
КонецФункции

Функция СоединитьТаблицыТоваровНаОтборИРазмещение(ТаблицаТоваровНаОтбор, ТаблицаТоваровНаРазмещение);   
	
	РК = вмс_РаботаСКоллекциями;
	КолонкиТаблицы = РК.ПолучитьКолонкиКоллекции(ТаблицаТоваровНаОтбор);
	ОбщаяТаблицаПодпитки = РК.НоваяТаблицаЗначений(РК.МассивВСтроку(КолонкиТаблицы));
	
	ПланОтбораДляОбработки = ТаблицаТоваровНаОтбор.Скопировать();
	ПланОтбораДляОбработки.Колонки.Добавить("Обработано", Новый ОписаниеТипов("Булево"));  
	
	Для Каждого СтрокаРазмещения Из ТаблицаТоваровНаРазмещение Цикл
		ОтборТовара = Новый Структура("Номенклатура, Характеристика, Серия, Обработано", СтрокаРазмещения.Номенклатура, СтрокаРазмещения.Характеристика, СтрокаРазмещения.Серия, Ложь);
		НайденныеСтроки = ПланОтбораДляОбработки.НайтиСтроки(ОтборТовара); 
		КоличествоНаРазмещение = СтрокаРазмещения.Количество;
		Для Каждого СтрокаОтбора Из НайденныеСтроки Цикл 
			Если КоличествоНаРазмещение = 0 Тогда
				Прервать;
			КонецЕсли;
			
			НоваяОбщаяСтрока = ОбщаяТаблицаПодпитки.Добавить();	  
			ЗаполнитьЗначенияСвойств(НоваяОбщаяСтрока, СтрокаРазмещения);
			НоваяОбщаяСтрока.ИдентификаторИнструкции = 0;     
			НоваяОбщаяСтрока.Ячейка = СтрокаОтбора.Ячейка;
			НоваяОбщаяСтрока.ЯчейкаПриемник = СтрокаРазмещения.ЯчейкаПриемник; 		

			Если КоличествоНаРазмещение < СтрокаОтбора.Количество Тогда
				НоваяОбщаяСтрока.Количество = КоличествоНаРазмещение; 
				СтрокаОтбора.Количество = СтрокаОтбора.Количество - КоличествоНаРазмещение;
				КоличествоНаРазмещение = 0;   
			Иначе
				НоваяОбщаяСтрока.Количество = СтрокаОтбора.Количество;   
				КоличествоНаРазмещение = КоличествоНаРазмещение - СтрокаОтбора.Количество;
				СтрокаОтбора.Количество = 0;
				СтрокаОтбора.Обработано = Истина;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;  
	
		// проверка себя	
	//ОтборНеОбработанного = Новый Структура("Обработано", Ложь);
	//ТоварБезОстатка = ПланОтбораДляОбработки.НайтиСтроки(ОтборНеОбработанного);

	Возврат ОбщаяТаблицаПодпитки;	
		
КонецФункции

Функция ПолучитьТаблицуЯчеекЗоныДоступа(МассивЗонДоступа)   
	
	лТекст = "
		|ВЫБРАТЬ  
		|	вмс_ЯчейкиПоЗонамБыстрогоДоступа.ЗонаДоступа КАК ЗонаДоступа,
		|	вмс_ЯчейкиПоЗонамБыстрогоДоступа.Ячейка КАК Ячейка,   
		|	вмс_ЯчейкиПоЗонамБыстрогоДоступа.Ячейка.Помещение КАК Помещение,
		|	вмс_ЯчейкиПоЗонамБыстрогоДоступа.Ячейка.Владелец КАК Склад
		|ИЗ
		|	РегистрСведений.вмс_ЯчейкиПоЗонамБыстрогоДоступа КАК вмс_ЯчейкиПоЗонамБыстрогоДоступа
		|ГДЕ
		|	вмс_ЯчейкиПоЗонамБыстрогоДоступа.ЗонаДоступа В (&МассивЗонДоступа)
		|";

	лЗапрос = Новый Запрос(лТекст);

	// Установка параметров.
	лЗапрос.УстановитьПараметр("МассивЗонДоступа", МассивЗонДоступа);

	ТаблицаЯчеек = лЗапрос.Выполнить().Выгрузить();
    //МассивЯчеек = ТаблицаЯчеек.ВыгрузитьКолонку("Ячейка");
	
	Возврат ТаблицаЯчеек;

КонецФункции

Функция ПолучитьМассивОбязательныхКолонокЗаданияКладовщику()  
	ОбязательныеКолонки = Новый Массив;
	
	ОбязательныеКолонки.Добавить("ИдентификаторИнструкции");  
	ОбязательныеКолонки.Добавить("ДополнительныеЯчейки");  
	ОбязательныеКолонки.Добавить("СпособВводаСерии");     
	ОбязательныеКолонки.Добавить("Партия");   
	ОбязательныеКолонки.Добавить("ЯчейкаПриемник");   
	ОбязательныеКолонки.Добавить("ЯчейкаТранзит");
	
	Возврат ОбязательныеКолонки;
	
КонецФункции

Процедура ПодготовитьТаблицуТоваровНаРазмещениеДляЗадания(ТаблицаТоваровНаРазмещение, МаршрутРазмещения) 
	
	Для каждого Строка Из ТаблицаТоваровНаРазмещение Цикл
		
		Отбор = Новый Структура("Товар, Характеристика", Строка.Номенклатура, Строка.Характеристика);
		НайденныеСтроки = МаршрутРазмещения.НайтиСтроки(Отбор);
		ПерваяЯчейка = Истина;
		ДополнительныеЯчейки = Новый Массив;
		
		Для каждого НайденнаяСтрока Из НайденныеСтроки Цикл
			Если ПерваяЯчейка Тогда
				Строка.ЯчейкаПриемник = НайденнаяСтрока.Ячейка;
				ПерваяЯчейка = Ложь;
			Иначе
				ДополнительныеЯчейки.Добавить(НайденнаяСтрока.Ячейка);
			КонецЕсли;
		КонецЦикла;
		
		Строка.ДополнительныеЯчейки = вмс_РаботаСКоллекциями.МассивВСтроку(ДополнительныеЯчейки, ",");
		
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьЗаданиеНаПодпитку(ДанныеЗаданияКладовщика)
	
	РК = вмс_РаботаСКоллекциями;
	
	Задание = Документы.вмс_ЗаданиеКладовщику.СоздатьДокумент();
	Задание.Заполнить(Неопределено);
	Задание.АвтоНастройкаПолей = Истина;
	ЗаполнитьЗначенияСвойств(Задание, ДанныеЗаданияКладовщика.ДетальныеДанныеПодпитки);
	Задание.Дата = ТекущаяДатаСеанса();
	Задание.Операция = ДанныеЗаданияКладовщика.Операция;
	
	// ТУ_Алфимов 16.07.2026 ++ 3.2.5
	//Задание.Правило = ДанныеЗаданияКладовщика.ПравилоПодпитки;
	Задание.Правило = Справочники.вмс_ПравилаЗаполненияЗадачиКладовщику.НайтиПоРеквизиту("Имя", "Подпитка");
	// ТУ_Алфимов 16.07.2026 -- 3.2.5
	
	Задание.Комментарий = "Подпитка: " +  РК.МассивВСтроку(ДанныеЗаданияКладовщика.МассивЗонДоступа);
	Задание.Товары.Загрузить(ДанныеЗаданияКладовщика.ТаблицаТоваров);
	Задание.Записать(РежимЗаписиДокумента.Проведение);
	
КонецПроцедуры

Функция ПодготовитьПараметрыОтбораНаПодпитку(ПравилоПодпитки, ТаблицаТоваров, ДанныеОтбора = Неопределено)  
	
	ПараметрыЗаполненияОтбора = вмс_ОтборСервер.НовыйПараметрыЗаполненияОтбора();
	
	ПараметрыЗаполненияОтбора.Товары = ТаблицаТоваров; 
	Если ПравилоПодпитки.ПодбиратьЯчейкиПоСкладам Тогда
		ПараметрыЗаполненияОтбора.Склад = ДанныеОтбора.Склад;
	КонецЕсли;   
	
	Если ПравилоПодпитки.ОтбиратьПоПомещениям Тогда
		ПараметрыЗаполненияОтбора.Помещение = ДанныеОтбора.Помещение;
	КонецЕсли;
	
	ПараметрыЗаполненияОтбора.Правило = ПравилоПодпитки;
	
	ДоступныеТипы  = Новый Массив;
	ДоступныеТипы.Добавить(Перечисления.вмс_ТипыЯчеек.Хранение);
	
	ПараметрыЗаполненияОтбора.ТипыЯчеек = ДоступныеТипы; 
	
	// ТУ_Алфимов 16.07.2026 ++ 3.2.5
	// В момент когда нужен объект Задания кладовщика, его нет, ошибка в вмс_ОтборСервер.ДобавитьТаблицуЗапросаДвиженияЗадания() (костыль)
	Если Не ЗначениеЗаполнено(ПараметрыЗаполненияОтбора.ЗаданиеКладовщику) Тогда
		ЗаданиеОбъект = Документы.вмс_ЗаданиеКладовщику.СоздатьДокумент();
		ПараметрыЗаполненияОтбора.ЗаданиеКладовщику = ЗаданиеОбъект; 
	КонецЕсли;
	// ТУ_Алфимов 16.07.2026 -- 3.2.5
	
	Возврат ПараметрыЗаполненияОтбора;
	
КонецФункции

Функция ПодготовитьТаблицуТоваровДляПодитки(ТаблицаДефицита)

	РК = вмс_РаботаСКоллекциями;
	ТаблицаТоваров = РК.НоваяТаблицаЗначений("Номенклатура, Характеристика, Серия, Упаковка, Количество, ВесЕдиницыТовара, ОбъемЕдиницыТовара, ЗонаДоступа");
	ПустаяХарактеристика = вмс_АдаптацияКонфигураций.ПустаяХарактеристика();
	ПустаяУпаковка = вмс_АдаптацияКонфигураций.ПустаяУпаковка();
	ПустаяСерия = Справочники.вмс_СерииНоменклатуры.ПустаяСсылка();
	
	Для Каждого Строка Из ТаблицаДефицита Цикл
		НоваяСтрока = ТаблицаТоваров.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
	//	НоваяСтрока.Характеристика = ПустаяХарактеристика;
		НоваяСтрока.Упаковка = ПустаяУпаковка;
	КонецЦикла;
	
	Возврат ТаблицаТоваров;
	
КонецФункции 

Функция ПоследняяПодпиткаЗавершена(ОперацияПодпитка,Отбор)
	
	ПоследнееЗаданиеПодпитки = ПолучитьПоследнееЗаданиеНаПопдиткуПоОтбору(ОперацияПодпитка,Отбор);
	Если ПоследнееЗаданиеПодпитки = Неопределено Тогда
		// Значит это первое задание на подпитку
		Возврат Истина;
	КонецЕсли;
	
	ДанныеОСтатусеПодпитки = РегистрыСведений.вмс_СтатусыДокументов.ПолучитьДанныеОСтатусеДокумента(ПоследнееЗаданиеПодпитки); 
	СтатусЗавершения = вмс_ОперацииПоЯчейкамВызовСервера.ПолучитьСтатусЗавершенияОперации(ОперацияПодпитка); 

	Если ДанныеОСтатусеПодпитки.Статус = СтатусЗавершения Тогда
		Возврат Истина	
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции    


Функция ПолучитьПоследнееЗаданиеНаПопдиткуПоОтбору(ОперацияПодпитка, ПоляОтбора)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	вмс_ЗаданиеКладовщику.Ссылка КАК Задание
		|ИЗ
		|	Документ.вмс_ЗаданиеКладовщику КАК вмс_ЗаданиеКладовщику
		|ГДЕ
		|	вмс_ЗаданиеКладовщику.Операция = &Операция
		|	УсловиеОтбора
		|
		|УПОРЯДОЧИТЬ ПО
		|	вмс_ЗаданиеКладовщику.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Операция", ОперацияПодпитка);
	
	УсловиеОтбора = "";  
	Если ПоляОтбора.Свойство("Склад") Тогда   
		УсловиеОтбора = УсловиеОтбора + " И вмс_ЗаданиеКладовщику.Склад = &Склад"; 
		Запрос.УстановитьПараметр("Склад", ПоляОтбора.Склад);
	КонецЕсли; 
	
	Если ПоляОтбора.Свойство("Помещение")Тогда  
		УсловиеОтбора = УсловиеОтбора + " И вмс_ЗаданиеКладовщику.Помещение = &Помещение"; 
		Запрос.УстановитьПараметр("Помещение", ПоляОтбора.Помещение);
	КонецЕсли;  
		
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "УсловиеОтбора", УсловиеОтбора);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Задание;
	
КонецФункции
	

#КонецОбласти
